# pandas의 기본 연산 - DataFrame 1

In [1]:
import pandas as pd

In [2]:
a = {'점수 1' : [10, 20, 30], '점수 2' : [20, 40, 60]}

In [3]:
df1 = pd.DataFrame(a)

In [4]:
df1

   점수 1  점수 2
0    10    20
1    20    40
2    30    60

In [5]:
b = {'점수 1' : [100, 200, 300], '점수 3' : [200, 400, 600]}

In [7]:
df2 = pd.DataFrame(b)

In [8]:
df2

   점수 1  점수 3
0   100   200
1   200   400
2   300   600

In [9]:
df3 = df1 + df2

In [10]:
df3  # '점수 2' 열과 '점수 3' 열은 중복되지 않으므로 NaN 반환

   점수 1  점수 2  점수 3
0   110   NaN   NaN
1   220   NaN   NaN
2   330   NaN   NaN

In [11]:
df4 = df1.add(df2, fill_value = 0)

In [12]:
df4

   점수 1  점수 2   점수 3
0   110  20.0  200.0
1   220  40.0  400.0
2   330  60.0  600.0

In [13]:
df5 = df1.sub(df2, fill_value = 0)

In [14]:
df5

   점수 1  점수 2   점수 3
0   -90  20.0 -200.0
1  -180  40.0 -400.0
2  -270  60.0 -600.0

In [15]:
df6 = df1.mul(df2, fill_value = 1)

In [16]:
df6

   점수 1  점수 2   점수 3
0  1000  20.0  200.0
1  4000  40.0  400.0
2  9000  60.0  600.0

In [17]:
df7 = df1.div(df2, fill_value = 1)

In [18]:
df7

   점수 1  점수 2      점수 3
0   0.1  20.0  0.005000
1   0.1  40.0  0.002500
2   0.1  60.0  0.001667